gdgly/stm32L151_nbiot_tmote_app_spot/Libraries/NBIot/nbiotfunc.c
exit:
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadMinOrFullFunc(NBIOT_ClientsTypeDef* pClient)
 @Description			NBIOT_Neul_NBxx_CheckReadMinOrFullFunc		: 查询设备功能
 @Input				pClient								: NBIOT客户端实例
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadMinOrFullFunc(NBIOT_ClientsTypeDef* pClient)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
	
	sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+CFUN?\r");
	pClient->ATCmdStack->ATSendlen = strlen("AT+CFUN?\r");
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_OK) {
		if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+CFUN:1")) {
			pClient->Parameter.functionality = FullFunc;
		}
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+CFUN:0")) {
			pClient->Parameter.functionality = MinFunc;
		}
		else {
			NBStatus = NBIOT_ERROR;
		}
	}
#if NBIOT_PRINT_ERROR_CODE_TYPE
	else {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#endif
	
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetNewMessageIndications(NBIOT_ClientsTypeDef* pClient, NBIOT_OpenOrCloseFuncTypeDef state)
 @Description			NBIOT_Neul_NBxx_SetNewMessageIndications	: 设置NNMI功能是否开启
 @Input				pClient								: NBIOT客户端实例
					state								: CloseFunc / OpenFunc
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetNewMessageIndications(NBIOT_ClientsTypeDef* pClient, NBIOT_OpenOrCloseFuncTypeDef state)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
	
	if (state == CloseFunc) {											//关闭
		sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+NNMI=0\r");
		pClient->ATCmdStack->ATSendlen = strlen("AT+NNMI=0\r");
	}
	else if (state == OpenFunc) {											//开启
		sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+NNMI=1\r");
		pClient->ATCmdStack->ATSendlen = strlen("AT+NNMI=1\r");
	}
	else {
		NBStatus = NBIOT_ERROR;
		goto exit;
	}
	
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
#if NBIOT_PRINT_ERROR_CODE_TYPE
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_ERROR) {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#else
	NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack);
#endif
	
exit:
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadNewMessageIndications(NBIOT_ClientsTypeDef* pClient)
 @Description			NBIOT_Neul_NBxx_CheckReadNewMessageIndications	: 查询NNMI功能是否开启
 @Input				pClient									: NBIOT客户端实例
 @Return				NBIOT_StatusTypeDef							: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadNewMessageIndications(NBIOT_ClientsTypeDef* pClient)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
	
	sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+NNMI?\r");
	pClient->ATCmdStack->ATSendlen = strlen("AT+NNMI?\r");
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_OK) {
		if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NNMI:1")) {
			pClient->Parameter.nnmistate = OpenFunc;
		}
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NNMI:0")) {
			pClient->Parameter.nnmistate = CloseFunc;
		}
		else {
			NBStatus = NBIOT_ERROR;
		}
	}
#if NBIOT_PRINT_ERROR_CODE_TYPE
	else {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#endif
	
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetSentMessageIndications(NBIOT_ClientsTypeDef* pClient, NBIOT_OpenOrCloseFuncTypeDef state)
 @Description			NBIOT_Neul_NBxx_SetSentMessageIndications	: 设置NSMI功能是否开启
 @Input				pClient								: NBIOT客户端实例
					state								: CloseFunc / OpenFunc
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetSentMessageIndications(NBIOT_ClientsTypeDef* pClient, NBIOT_OpenOrCloseFuncTypeDef state)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
	
	if (state == CloseFunc) {											//关闭
		sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+NSMI=0\r");
		pClient->ATCmdStack->ATSendlen = strlen("AT+NSMI=0\r");
	}
	else if (state == OpenFunc) {											//开启
		sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+NSMI=1\r");
		pClient->ATCmdStack->ATSendlen = strlen("AT+NSMI=1\r");
	}
	else {
		NBStatus = NBIOT_ERROR;
		goto exit;
	}
	
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
#if NBIOT_PRINT_ERROR_CODE_TYPE
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_ERROR) {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#else
	NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack);
#endif
	
exit:
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadSentMessageIndications(NBIOT_ClientsTypeDef* pClient)
 @Description			NBIOT_Neul_NBxx_CheckReadSentMessageIndications	: 查询NSMI功能是否开启
 @Input				pClient									: NBIOT客户端实例
 @Return				NBIOT_StatusTypeDef							: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadSentMessageIndications(NBIOT_ClientsTypeDef* pClient)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
	
	sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+NSMI?\r");
	pClient->ATCmdStack->ATSendlen = strlen("AT+NSMI?\r");
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_OK) {
		if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NSMI:1")) {
			pClient->Parameter.nsmistate = OpenFunc;
		}
		else if (strstr((const char*)pClient->ATCmdStack->ATRecvbuf, "+NSMI:0")) {
			pClient->Parameter.nsmistate = CloseFunc;
		}
		else {
			NBStatus = NBIOT_ERROR;
		}
	}
#if NBIOT_PRINT_ERROR_CODE_TYPE
	else {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#endif
	
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetSupportedBands(NBIOT_ClientsTypeDef* pClient, NBIOT_BandTypeDef bands)
 @Description			NBIOT_Neul_NBxx_SetSupportedBands			: 设置Band
 @Input				pClient								: NBIOT客户端实例
					bands								: ChinaTelecom						= 5
														  ChinaMobile						= 8
														  ChinaUnicom						= 20
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetSupportedBands(NBIOT_ClientsTypeDef* pClient, NBIOT_BandTypeDef bands)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
	
	memset((void *)pClient->DataProcessStack, 0x0, pClient->DataProcessStack_size);
	sprintf((char *)pClient->DataProcessStack, "AT+NBAND=%d\r", bands);
	
	memcpy(pClient->ATCmdStack->ATSendbuf, pClient->DataProcessStack, strlen((char *)pClient->DataProcessStack));
	pClient->ATCmdStack->ATSendlen = strlen((char *)pClient->DataProcessStack);
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
#if NBIOT_PRINT_ERROR_CODE_TYPE
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_ERROR) {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#else
	NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack);
#endif
	
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadSupportedBands(NBIOT_ClientsTypeDef* pClient)
 @Description			NBIOT_Neul_NBxx_CheckReadSupportedBands		: 查询Band
 @Input				pClient								: NBIOT客户端实例
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadSupportedBands(NBIOT_ClientsTypeDef* pClient)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	int bands = 0;
	
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
	
	sprintf((char *)pClient->ATCmdStack->ATSendbuf, "AT+NBAND?\r");
	pClient->ATCmdStack->ATSendlen = strlen("AT+NBAND?\r");
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_OK) {
		if (sscanf((const char*)pClient->ATCmdStack->ATRecvbuf, "\r\n+NBAND:%d\r", &bands) <= 0) {
			NBStatus = NBIOT_ERROR;
		}
		else {
			if (bands == ChinaTelecom) {
				pClient->Parameter.band = ChinaTelecom;
			}
			else if (bands == ChinaMobile) {
				pClient->Parameter.band = ChinaMobile;
			}
			else if (bands == ChinaUnicom) {
				pClient->Parameter.band = ChinaUnicom;
			}
			else {
				NBStatus = NBIOT_ERROR;
			}
		}
	}
#if NBIOT_PRINT_ERROR_CODE_TYPE
	else {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#endif
	
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetReportTerminationError(NBIOT_ClientsTypeDef* pClient, NBIOT_ReportErrorTypeDef enable)
 @Description			NBIOT_Neul_NBxx_SetReportTerminationError	: 设置CMEE
 @Input				pClient								: NBIOT客户端实例
					enable								: CMEDisable						= 0
														  CMEEnable						= 1
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetReportTerminationError(NBIOT_ClientsTypeDef* pClient, NBIOT_ReportErrorTypeDef enable)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
	
	memset((void *)pClient->DataProcessStack, 0x0, pClient->DataProcessStack_size);
	sprintf((char *)pClient->DataProcessStack, "AT+CMEE=%d\r", enable);
	
	memcpy(pClient->ATCmdStack->ATSendbuf, pClient->DataProcessStack, strlen((char *)pClient->DataProcessStack));
	pClient->ATCmdStack->ATSendlen = strlen((char *)pClient->DataProcessStack);
	pClient->ATCmdStack->ATack = "OK";
	pClient->ATCmdStack->ATNack = "ERROR";
	NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack);
	
	return NBStatus;
}

/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadReportTerminationError(NBIOT_ClientsTypeDef* pClient)
 @Description			NBIOT_Neul_NBxx_CheckReadReportTerminationError	: 查询CMEE
 @Input				pClient									: NBIOT客户端实例
 @Return				NBIOT_StatusTypeDef							: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadReportTerminationError(NBIOT_ClientsTypeDef* pClient)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	int enable = 0;
	
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
	
